/* 회칙에 변경된 사항이 있으면 반영해주세요. */

export const RULES = [
  {
    title: '[제1장] 총칙',
    contents: `
    제1조(명칭)
    본 회는 대학생 연합동아리로 명칭은 SOPT(이하 본 회)라고 칭한다.

    제2조(목적)
    본 회는 회원들 간의 연구 및 개발 활동을 통하여 회원 각자의 실력향상으로 IT 인재를 양성하고 회원 상호간의 친목도모와 정보공유의 장을 마련하며, 공동협력을 통하여 성공적인 IT벤처창업을 준비하는 것을 목적으로 한다.

    제3조(소재지)
    본 회는 서울/경기 지역에 주 근거지를 두며, 온라인 상에는 홈페이지 (http://sopt.org)에 둔다.

    제4조(사업)
    본 회는 제2조의 목적을 달성하기 위하여 다음의 내용을 이행한다.
    회원 상호 간의 친목 도모
    실력향상을 위한 커리큘럼 진행
    정부, 민간단체, 연구기관과의 공동협력 추진
    홍보사업 및 간행물 발간
    기타 본 회의 목적에 부합하는 사업의 전개

    제5조(정치적 중립성)
    본 회는 정치 단체의 후원 및 정치 단체와의 정치적 목적 하의 협력, 교류를 거부한다.
    정치 단체는 정당 및 정당 후원, 관련 단체를 의미한다.

    제6조(회칙)
    본 회의 모든 결정 사항은 이 회칙을 기반으로 행해진다.

    제7조(해산)
    본 회를 해산하고자 할 때는 총회에서 출석회원 3분의 2 이상의 동의를 얻어야 한다.
    본 회의 해산 종료 후 잔여재산의 처분은 총회의 결정을 따른다.
    `,
  },
  {
    title: '[제2장] 조직',
    contents: `
    제8조(회원) 
    가입 및 탈퇴: 기수별 실시되는 일정한 가입심사 절차를 통하여 가입할 수 있으며, 본인의 의사 표현을 통해 언제라도 탈퇴할 수 있다.
    회원의 분류
    1) 신입회원: 일정한 가입심사 절차를 통해 정식 동아리 활동을 시작하여 지속적인 세미나 참가를 하며 수료하지 않은 정회원을 지칭한다.
    2) OB: 신입회원으로 제적, 제명 당하지 않고 한 기수 이상의 기간 동안 동아리에서 활동하여 정식 수료한 회원을 OB라 지칭한다.
    3) 활동회원: OB 중 신입회원과 함께 지속적인 세미나 참가를 하고 있는 회원을 지칭한다.
    4) 명예회원: OB 중 졸업 또는 기타 사정으로 인하여 동아리 활동을 지속하고 있지 않는 회원을 지칭한다.
    5) 정회원: 현재 지속적인 세미나를 참가 하고 있는 신입회원과 활동회원을 모두 정회원이라 한다.
    회원의 권리: 회원은 본 회의 각종 행사에 우선적으로 참여할 수 있는 권리를 갖는다. 또한 총회에서 발언권과 제안권을 갖는다. 본 회의 운영에 대한 의견을 자유롭게 건의할 수 있다.
    회원의 의무: 입회비를 납부하여야 하며, 회원은 본 회의 각종모임에 적극 참여해야 하며, 본 회의 규정을 준수해야 한다.

    제9조(자격)
    현재 대학교에 재학 중이거나, 휴학 중인 자로서 본 회의 구성원 중 회비 납비 후 지속적인 활동이 가능한 자를 정회원으로 인정한다.

    제10조(출석)
    정회원에게는 출석 점수를 부여한다.
    출석 점수는 다음의 규칙을 따른다.
    1) 기수가 시작될 시 모든 정회원에게 2.0점의 출석 점수를 부여한다.
    2) 정회원의 출석 점수가 0점 미만이 될 경우 제명한다.
    감점
    정회원이 세미나에 지각할 경우 출석 점수를 0.5점 감점하며, 결석할 경우 1점을 감점한다. 다음과 같은 이유로 세미나에 참석하지 못할 경우 출석 점수를 감점하지 않는다.
    1) 직계가족의 조사
    2) 천재지변
    3) 대학교 전공/교양/졸업 시험 (단, 사전에 시험 진위여부를 판단할 수 있는 자료를 제출할 경우만 해당한다.)

    제11조(임원)
    본 회에 다음 임원을 둘 수 있다.
    1) 회장
    2) 부회장
    3) 총무
    4) 기획파트장
    5) 개발파트장
    6) 디자인파트장
    7) 운영팀장
    8) 미디어팀장
    자격: 본 회의 임원이라 함은 각 단위기구의 장 및 간부회원으로서 제 5장의 선거 절차를 필한 자로 한다.
    권리: 각 단위기구의 운영에 대한 권한을 갖는다.
    의무: 본 회의 규정을 준수해야 한다.
    그 외 각 단위기구의 장에 의해 해당 단위기구의 임원을 둘 수 있다.
    임원이 임기를 마치지 못하고 특정 사유로 인해 중도 하차할 경우 별도 규정의 운영위원 인준절차를 걸쳐 해당 직책의 임원을 선출할 수 있다.

    제12조(특수 임원)
    본 회에서 매 기수활동과 별개로 독립적으로 진행되는 행사에 한해서 특수 임원을 둘 수 있다.
    1) Scon 위원장: 본 회에서 기획, 진행되는 Conference의 장으로서 Conference 진행에 정, 부회장의 동의 하에 독립적으로 업무를 진행할 수 있다.
    2) makers 팀장: 본 회를 위한 서비스를 만드는 것을 담당한다. 정, 부회장의 동의 하에 독립적으로 업무를 진행할 수 있다.
    자격: 본 회의 특수 임원이라 함은 특수 단위기구의 장으로서 별도규정의 특수임원 인준 절차를 필한 자로 한다.
    권리: 각 단위기구의 운영에 대한 권한을 갖는다.
    의무: 본 회의 규정을 준수해야 한다.
    특수 임원에 대한 정식 임원으로의 승격은 <제11조(임원)> 조항에 대한 회칙 개정을 통해 가능하며, 이를 통해 정식 임원으로 승격된 특수 임원에 대한 별도의 선거를 진행하지 않는다.

    제13조(직위)
    회장은 본 회를 대표하여 총회, 운영위원회 임원를 총괄한다. 회장은 본 회를 대표하여 모든 회의의 의장이 된다.
    부회장은 회장을 보좌하며, 회장이 궐위되거나 사고로 인하여 직무를 수행할 수 없을 때에는 그 권한을 대행한다.

    제14조(권한)
    임원의 각 단위기구의 장은 각 단위기구에 대한 모든 권한이 있다. 따라서 단위기구 장에 의해 개별적으로 운영이 가능하며 해당 단위기구내에 임원을 둘 수 있다.
    각 단위기구의 장은 단위기구에 영향을 끼치는 모든 결정에 대한 내용을 회원들에게 알려야 한다.

    제15조(임기)
    회장, 부회장을 비롯한 모든 임원은 모두 해당 기수를 기준으로 한다.
    정,부회장을 포함한 임원은 중임이 가능하다.

    제16조 (복권)
    징계를 받은 회원은 총회의 결의로 복권될 수 있다.
    `,
  },
  {
    title: '[제3장] 총회',
    contents: `
    제17조(지위)
    본 회의 총회는 본 회의 활동에 관한 최고 의결권을 가진다.

    제18조(구성)
    총회는 본 회의 전 회원 및 임원로 구성되며 의장은 특이사항이 없는 한 회장으로 한다.

    제19조(권한)
    총회는 본 회의 회원 전체에게 관련된 중대한 사항을 토의, 결정한다.
    총회는 정,부회장의 탄핵결정권을 갖는다.

    제20조(소집)
    총회는 정례모임 시에 소집한다.

    제21조(심의) 총회는 다음의 사항을 심의한다.
    정관 변경에 관한 사항
    사업 계획 및 보고의 승인
    예산 및 결산 보고의 승인
    회장 및 부회장, 운영위원 선출 및 해임
    각 단위기구의 운영상황 점검

    제22조(의결)
    총회의 의결은 출석회원의 과반수 이상의 찬성으로 한다.
    정, 부회장의 불신임 결정에 관한 총회는 임원에서 권한을 위임 받은 자의 진행아래 개의하고 참석인원 2/3이상의 찬성으로 의결한다.

    제23조 (개회 및 의결 정족수)
    총회의 안건은 출석 회원 과반수 이상의 찬성으로 의결하되, 정관 개정의 사항은 출석 회원 3분의 2이상의 찬성으로 의결한다.
    `,
  },
  {
    title: '[제4장] 자산과 회계',
    contents: `
    제24조(자산)
    본 회의 자산은 다음 각 호의 것으로 한다.
    
    재산목록에 기재한 재산
    회비
    기타 수입

    제25조(회비)
    신입회원은 가입비와 활동비를 납부해야 하며 활동을 원하는 OB는 활동비를 납부해야 한다. 활동기수의 임원과 비활동 OB는 회비납부의 의무를 갖지 않는다. 본인의 마지막 활동 기수를 수료하지 못한 OB가 다음 기수를 지원할 경우 가입비를 다시 내야 활동 가능하다.

    제26조(자산의 단분성)
    본 회의 회원이 그 자격을 상실하거나 거부했을 때에는 본 회의 자산에 반환청구를 할 수 없다.

    제27조(잉여금)
    결산결과 잉여금 또는 결손금이 생긴 때에는 다음 회계연도로 이월한다.

    제28조(회계연도)
    본 회의 회계연도는 해당 기수 시작일로부터 하여 종료일까지로 한다.

    제29조(회계공개)
    회비 관리는 물론 본 회의 회계 내용은 모든 회원에게 매주 공개를 원칙으로 한다. 해당 기수 종료일엔 사업보고서 및 수입지출결산서를 모든 회원에게 보고 하여야 한다.

    제30조(사용)
    본 회의 자산을 사용함에 있어 영수증 처리를 원칙으로 한다.

    제31조(예산 및 결산)
    회장, 부회장, 총무는 예산 및 결산에 대한 권한이 있다.
    `,
  },
  {
    title: '[제5장] 선거',
    contents: `
    제32조(선거의 방법)
    본 회의 선거는 직접, 보통, 비밀, 평등선거를 원칙으로 한다.
    회원의 과반수 동의 아래 다른 방식의 선거를 통하여 어떠한 선택에 대한 결정을 할수 있다.
    정,부회장을 포함한 운영위원 선출을 위한 선거는 반드시 민주주의적 절차에 의해 회원들의 투표로 진행된다.

    제33조(선거권)
    선거권은 본 회의 정회원과 역대 임원진으로 한다.

    제34조(피선거권)
    임원후보의 자격은 본 회의 회원으로 한다.

    제35조(시행세칙)
    선거에 관한 세부사항은 본 회 회칙에 의한다.
    `,
  },
  {
    title: '[제6장] 포상 및 징계',
    contents: `
    제36조(포상과 경조사)
    회의를 통하여 본 회의 사업에 모범을 보인 회원, 운영위원 및 각 기구에 대해 포상 할 수 있다.
    회원 상호간의 경조사에 대한 운영과 예산 집행은 별도 규정에 따른다.

    제37조(징계)
    본 회의 명예를 실추시키거나 본 회의 회칙을 준수하지 않은 회원 및 운영위원에 대하여는 징계위원회에서 경고, 제명 등의 징계를 결의할 수 있다.
    징계를 내릴 시, 징계 내용을 회원들에게 공지하여야 한다.

    제38조(징계위원회)
    징계위원회는 운영위원회 내에서 구성되며 최소 7인 이상 출석 하였을 시에 개회할 수 있다.
    징계는 징계위원회 출석위원의 2/3 이상 동의한 내용으로 징계 처분을 내린다.
    운영위원회 내부 인원이 연루된 사안을 논의할 경우, 운영위원회는 징계위원회 자격을 잃고, 총회를 통해 징계를 결의한다.
    총회에서 징계를 결의할 경우, 출석회원의 2/3 이상 동의한 내용으로 징계 처분을 내린다.
    징계는 ‘제 38조 징계의 종류’에 명시되어 있는 내용을 따른다.

    제39조(징계의 종류) 징계의 종류는 다음과 같다.
    제명
    경고
    공개 사과문 작성

    제40조(징계 내용 공지)
    징계가 결의된 후, 징계위원회는 해당 회원에 대한 징계 내용을 아래의 절차를 거쳐 공지해야 한다.
    징계 처분 후 14일 이내에 정기 세미나가 열리는 경우, 회장은 총회 시간에 징계 내용을 공지해야 한다.
    징계 처분 후 14일 이내에 정기 세미나가 예정되어 있지 않은 경우, 회장은 해당 기수 온라인 커뮤니티(페이스북 그룹)에 징계 공고문을 작성하여 게시한다.

    제41조(징계 사유)
    징계위원회는  본 회 회원에게 다음에 사유가 생겼을 때 징계를 결의할 수 있다.
    본 회의 목적에 위배되는 행위를 했을 경우
    본 회의 명예를 훼손한 경우
    회원의 의무를 성실히 이행하지 않았을 경우
    본 회 또는 회원에 대하여 손해를 가하는 불의의 행위를 한 경우
    총회의 결의 사항을 준수, 이행치 아니하는 자
    제1장 제5조에 의거하여 본 회 및 본 회의 회원을 정치적 목적으로 이용하려고 하는 자
    제1장 제5조에 의거하여 본 회 내에서 정치적 목적의 콘텐츠를 유포하는 자

    제42조(성적 자기 결정권 침해 사례)
    성적 자기 결정권 침해 사례가 발생한 경우, 징계위원회는 사례가 제보된 3일 이내에 징계위원회를 개회하여야 한다.
    징계위원회는 피해 회원의 신변 보호를 최우선으로 하며, 피해 회원이 공론화하길 원하는 경우를 제외한 어떠한 경우에도 피해 내용에 대하여 비밀을 보장할 의무가 있다.
    징계위원회는 피해 회원이 원하는 구제 내용을 적극적으로 이행할 의무가 있다.
    피의 회원이 징계의 이행을 수용하지 않을 경우, 피의 회원의 소속 학교(단체)의 인권(성평등)센터에 사건을 이관한다. (단, 피해 회원이 동의할 경우에 한함)
    징계위원회는 합의한 경우를 제외한 어떠한 경우에도 피해 및 피의 회원의 익명성을 유지할 의무가 있으며, 자의적인 사법적 판단을 할 수 없다.
    징계위원회는 피해 회원이 사법적 절차를 진행하길 원할 경우 적극적으로 절차 진행을 지원하여야 한다.
    징계위원회 내부에 피의 회원이 있을 경우, 피의 회원의 소속 학교(단체)의 인권(성평등)센터에 사건을 이관한다. (단, 피해 회원이 동의할 경우에 한함)
    성적 자기 결정권 침해 사례에 대한 징계 논의는 총회로 이관될 수 없다.
    `,
  },
  {
    title: '[제7장] 개정',
    contents: `
    제43조(회칙 개정)
    본 회칙의 개정은 총회에서 정회원이 2/3이상 출석하고 출석회원 2/3 이상의 동의를 얻어야 한다.
    본 회칙의 개정은 본 회의 본래의 취지에 어긋나지 않아야 한다.
    `,
  },
  {
    title: '[제8장] 행사',
    contents: `
    제44조(일시)
    매주 토요일 정례모임을 갖는다.

    제45조(행사참가비)
    전체 회원이 아닌 별도의 참가 신청자를 대상으로 행사를 진행할 경우, 행사 진행 비용의 규모에 따라 참가자에게 참가비를 부과할 수 있다. 참가비 부과 여부는 임원 회의를 통해 결정한다.
    참가비가 부과되는 행사의 경우, 참석자들에게 부과된 참가비의 총액이 행사 진행 비용의 총액을 넘지 않아야 한다.
    행사를 기획하고 운영하는 업무를 수행하는 회원은 해당 행사에 대한 참가비를 면제받는다.

    제46조(APPJAM)
    본 행사는 전체회원을 참가 신청 대상으로 하는 장기 해커톤을 말한다.
    참여자 : 본 행사의 팀빌딩에 참여하여 팀빌딩이 이루어진 회원으로 정의한다.
    참여자의 의무 : 본 행사 기간 동안 참여 역할에 대해 성실하고 적극적으로 임해야한다.
    중도 포기
    본 행사 참여자가 행사 기간 중 의무를 다하지 못하고 참여를 포기하는 것을 말한다. 본 행사를 중도 포기할 경우 출석 점수를 1점 이상 감점한다.
    다음과 같은 사유로 본 행사를 중도 포기할 경우 출석 점수를 감점하지 않는다. (단, 본 행사를 진행하는 임원들의 판단하에 사유의 범위를 조정할 수 있다.)
    1) 직계가족의 조사
    2) 행사 참여에 지장을 줄 정도의 질병 또는 상해
    특수 참가자
    1) 자격 : 본 행사의 중도 포기자가 있는 팀의 경우 명예회원을 특수 참가자로 참여시킬 수 있다.
    2) 특수 참가자를 참여시킬 경우 본 행사를 진행하는 임원들과의 협의를 통해 이루어져야 한다. 본 행사를 진행하는 임원들과의 협의 없이 특수 참가자가 참여할 경우 해당 팀은 본 행사의 수상에 불이익이 있을 수 있다.
    `,
  },
  {
    title: '부칙',
    contents: `
    본 정관은 2008년 3월 1일 발효한다.
    1-1. 본 정관은 2010년 8월 1일 발효한다. (개정: 2010.07.31)
    1-2. 본 정관은 2018년 11월 11일 발효한다. (개정: 2018.11.10)
    1-3. 본 정관은 2021년 8월 1일 발효한다. (개정: 2021.07.31)
    2. 본 정관에 기재되지 않은 사항은 관련 법령의 규정과 일반관례에 따른다.
    `,
  },
];
