import { Part } from '@src/lib/types/universal';

export const infoMap: Record<Part, { info: string; fit: string[] }> = {
  [Part.PLAN]: {
    info: '린스타트업에 기초해 고객 문제정의 - 고객 발굴 - 검증 과정을 거쳐 비즈니스 전략과 핵심지표 설계까지 고객 관점 프로덕트를 만들고 운영하기 위한 모든 과정을 다룹니다.',
    fit: [
      '열정과 책임감을 가지고 기획에 진심으로 임할 분',
      '본인이 가진 지식과 경험을 아낌없이 공유하고, 원활한 소통을 위한 열려있는 마음과 자세를 가진 분',
      '본인에게 한계를 두지 않고 앞으로 나아가는 용기와 도전하는 자세를 가진 분',
      '본인이 가진 열정과 의지가 행동으로 드러나는 분',
    ],
  },
  [Part.DESIGN]: {
    info: 'Figma를 활용하여 UX/UI 디자인의 전반적인 프로세스를 배우고, 세미나에서 학습한 UX심리학, 브랜딩, 디자인 시스템 등의 이론을 기획자, 개발자와의 협업 과정에 적용해 보며 근거에 기반한 문제 해결을 경험합니다.',
    fit: [
      '자신의 디자인적 관점과 경험을 공유하며 함께 성장하실 수 있으신 분',
      '사용자의 경험에 기반한 UXUI디자인에 대해 고민해 보신 분',
      '타인의 피드백을 두려워하지 않고 새로운 것을 시도하며 도전적인 자세로 임하실 분',
      '사람들과 유대관계를 형성하는 것을 즐길 줄 아시는 분',
    ],
  },
  [Part.ANDROID]: {
    info: 'Kotlin 언어를 활용해 안드로이드 UI(XML/Compose) 구현 기초/심화, 서버 통신 등 앱 제작에 필요한 내용들을 배웁니다. 세미나, 정규 미미나를 통해 다양한 문제 상황을 해결할 수 있는 역량을 기르며 타 파트와의 협업을 통해 직접 서비스를 제작하는 경험을 얻을 수 있습니다.',
    fit: [
      '어려운 상황에도 두려움 없이 도전하며, 자신이 맡은 역할에 대한 책임감을 갖고 행동하는 분',
      '자신의 지식과 경험을 공유하고, 이를 통해 파트원들에게 긍정적인 영향을 미칠 수 있는 분',
      '상호간의 신뢰와 존중을 바탕으로 함께 목표를 달성하기 위해 협력하는 분',
    ],
  },
  [Part.IOS]: {
    info: 'Swift와 UI Kit를 이용해 iOS 앱 서비스를 만들 수 있습니다. iOS가 처음인 분들을 위한왕초보 스터디와 보충 세미나, 실력적 도약을 위한 심화 세미나까지 존재합니다.',
    fit: [
      '부족함을 성장의 기회로 느끼며, 열정을 겸비하여 용기있게 도전할 수 있으신 분',
      '같이의 가치를 중요시하며, 팀의 성장을 위해 아낌없이 공유할 수 있으신 분',
      '할 땐 하고, 놀 땐 그 누구보다 신나게 놀 수 있으신 분',
      '세상이 필요하는 서비스를 제공하기 위해 끊임없이 연구하는 Problem Solver의 자세를 가지신 분',
    ],
  },
  [Part.WEB]: {
    info: 'HTML, CSS, JavaScript로 기초를 다지고 React를 활용해 UI구현, 서버 통신, 다양한 라이브러리 사용 등 웹 서비스 개발에 필요한 역량들을 기초부터 심화까지 학습합니다. 또한 기획자, 디자이너, 서버 개발자와의 협업을 통해 나만의 웹 서비스를 만드는 경험을 해보실 수 있습니다.',
    fit: [
      '웹 프론트엔드 개발에 대한 확실한 목표를 가지고 노력해오신 분',
      '적극적이고 활발하게 SOPT와 웹 파트에 참여하실 분',
      '상호성장하는 기쁨과 공유의 가치를 아시는 분',
      '웹 파트에서 함께 공부하고 즐기며 소속감과 애착을 가지고 싶으신 분',
    ],
  },
  [Part.SERVER]: {
    info: '세미나를 통해 Spring 프레임워크, 관계형 데이터베이스, AWS, Docker를 기반으로 실제 서비스를 위한 서버 구축의 전반적인 내용을 배웁니다.또한 스터디와 코드리뷰, 미니 세미나를 등 개발 실력의 도약과 기획파트, 디자인파트, 클라이언트 파트와 협업을 통해 협업 방식을 익힐 수 있습니다.',
    fit: [
      '새로운 도전을 추구하며 이뤄가는 과정의 소중함을 아시는분',
      '뜨거운 열정을 불태워 회원들과 함께 성장할 준비가 되어있으신 분',
      '공부한 지식과 경험을 공유하며 유대를 통해 성장하는 경험을 만들어가고 싶으신 분',
      '목적의식을 가지고 서버파트에서 새로운 목표를 이뤄나가고 싶으신 분',
    ],
  },
};
