import { questionList } from '@src/lib/constants/faq';
import { ExtraPart, Part, PartExtraType } from '@src/lib/types/universal';

export const faqMap: Record<ExtraPart, { question: string; answer: string }[]> = {
  [PartExtraType.ALL]: questionList,
  [Part.PLAN]: [
    {
      question: '서비스 기획에 대한 경험과 경력이 없어도 괜찮을까요?',
      answer:
        '경험과 실력보다는 기획에 대한 열정과 기획파트를 통해 본인이 달성하고자 하는 명확한 목표와 액션플랜을 더 중요시합니다. 시장에 대한 관심과 창의력과 실행력만 겸비해오신다면 기획파트 활동을 온전하게 즐기실 수 있습니다.',
    },
    {
      question: '포트폴리오는 필수인가요?',
      answer: '포트폴리오는 필수가 아닌 선택사항입니다. 제출 여부에 따른 불이익은 없습니다.',
    },
    {
      question: '개발지식이 필요한가요?',
      answer:
        '아니요 무관합니다! 협업에 있어 기초적인 개발지식은 알면 좋지만, 이는 세미나를 통해 충분히 다뤄질 것이므로 걱정하지 않으셔도 됩니다.',
    },
  ],
  [Part.DESIGN]: [
    {
      question: '디자인 경험이 없는데 지원해도 되나요?',
      answer:
        '그럼요! 매주 진행되는 세미나와 파트 내 스터디를 통해 충분히 배워나갈 수 있습니다. 디자인을 향한 애정, 배우고자 하는 의지, 솝트 활동에 참여하겠다는 열정만 있으시면 됩니다.',
    },
    {
      question: '디자인 파트에서는 주로 어떤 툴을 사용하나요?',
      answer:
        '정규 세미나에서는 협업 툴인 Figma를 주로 사용하며, 협업 과정에서 필요시 Zeplin을 사용하기도 합니다. 툴이 생소해 걱정이라면, 세미나 또는 미미나에서 기본적인 사용법을 설명해 드릴 예정이니 함께 익혀봐요!',
    },
    {
      question: '어떤 스터디가 있나요?',
      answer:
        'UX 기획, Daily UI 100, 브랜딩과 같이 UXUI 디자이너로서 역량을 키울 수 있는 스터디와 더불어 Blender, After Effects 등 그래픽과 관련된 스터디도 진행될 예정입니다. 물론 하고 싶은 스터디를 자유롭게 열어주셔도 됩니다!',
    },
  ],
  [Part.ANDROID]: [
    {
      question: '아이폰, 맥북을 사용하고 있는데 지원이 가능한가요?',
      answer:
        '당연히 가능합니다! 갤럭시 핸드폰 또는 공기계가 없어도 본인이 개발한 앱을 확인해 볼 수 있습니다. MacOS 환경에서도 충분히 개발이 가능합니다.',
    },
    {
      question: '개발 경험이 거의 없는데 지원이 가능한가요?',
      answer:
        '그 누구나 안드로이드 개발에 대한 열정과 흥미만 가지고 있다면 안드로이드 파트에 지원하세요! 정규, 심화 세미나와 미미나, 스터디를 통해 공부하다보면 자신도 모르게 성장해있는 모습을 볼 수 있습니다.',
    },
    {
      question: '세미나에서 다루는 젯팩 컴포즈의 비율은 어떻게 되나요?',
      answer:
        '이번 34기부터는 컴포즈에 대한 세미나가 추가될 예정입니다, 대부분의 기본적인 UI는 XML로 진행되지만, 중간 중간 Compose를 맛볼 수 있는 기회가 있을거에요.',
    },
  ],
  [Part.IOS]: [
    {
      question: 'MacOS를 가진 장비가 필수인가요? 맥북이 필수인가요?',
      answer:
        'iOS 파트는 매주 정해진 공간에 모여 세미나및 실습을 진행하기 때문에, ‘맥북’이 필수입니다.',
    },
    {
      question: '개발 경험이 아예 없는데 지원해도 되나요?',
      answer:
        '매주 세미나를 통해 iOS의 기본부터 함께 배워가기 때문에, 개발경험은 상관이 없습니다. 하고자 하는 열정이 가장 중요한 요소라고 생각합니다.',
    },
    {
      question: 'UIKit을 이용해서 개발하나요?',
      answer:
        '34기 iOS파트의 정규 세미나는 UIKit으로 진행됩니다. 하지만, 스터디를 통해 SwiftUI와 같은 선언형 UI도 파트원들과 함께 공부해볼 수 있습니다!',
    },
  ],
  [Part.WEB]: [
    {
      question: '개발 실력이 부족한데 지원해도 되나요?',
      answer:
        '물론입니다. 웹 개발을 하고자 하는 열정과 끈기, 그리고 성장하고자 하는 의지만 있으시면 됩니다.',
    },
    {
      question: '세미나 진행은 어떻게 되나요?',
      answer:
        '웹 프론트엔드 개발에 필요한 커리큘럼으로 진행되며 8주의 세미나를 거치며 웹 서비스를 개발할 수 있는 역량을 충분히 기르실 수 있습니다. 자세한 내용은 34기 커리큘럼을 참고해 주세요!',
    },
    {
      question: '어떤 스터디가 있나요?',
      answer:
        '스터디는 파트원들이 하고 싶은 스터디를 자유롭게 열어주시면 됩니다. 대표적으로 React, JavaScript, TypeScript 스터디 그리고 웹 심화 스터디 등이 열리게 되며 이외에도 다양한 스터디를 열고 진행하실 수 있습니다.',
    },
  ],
  [Part.SERVER]: [
    {
      question: '서버 개발 지식이 없는데 지원해도 되나요?',
      answer:
        'Java 기초부터 함께 배워갑니다. 경험보다 매주 과제 및 스터디, 미니 세미나 등의 활동을 참여하고자 하는 열정이 가장 중요합니다.',
    },
    {
      question: '세미나의 내용을 초심자도 따라갈 수 있을까요?',
      answer:
        '초심자도 쉽게 따라올 수 있게 커리큘럼을 구성하였으니 여러분의 열정과 성장하고자 하는 의지와 함께라면 주저말고 지원해주세요.',
    },
    {
      question: '스터디, 미니세미나는 어떤 방식으로 진행되나요?',
      answer:
        '초심자를 위한 왕초보스터디, 심화적인 내용을 다루는 심화스터디가 필수로 진행됩니다. 이 외의 미니세미나/스터디는 수요가 있다면 적극적으로 지원하고 진행할 예정입니다.',
    },
  ],
};
